Repository: janglaide/TransportationProblemUncertainty
Catalog: Wpf/Properties/Resources.*.resx
Languages: uk_ua

# AccuracyPercentSearchLabel
source: Accuracy for percent search:
uk_ua: Точність для пошуку відсотка:

source: After changes
uk_ua: Після змін

# AlphaChangedLabel
source: Alpha changed:
uk_ua: Змінені ваги:

# AlphaLabel
source: Alpha:
uk_ua: Ваги:

# AnalysisButton
source: Analysis
uk_ua: Експерименти

# AnalysisDataSaveButton
source: Save data
uk_ua: Зберегти дані

# BackButton
source: Back
uk_ua: Назад

# CBasic
source: Basic
uk_ua: Базисні

# CDefault
source: All
uk_ua: Всі

# ChangeC
source: Change C values:
uk_ua: Зміна значень (C):

# ChooseAccuracyLabel
source: Choose accuracy (e):
uk_ua: Оберіть точність

# CNonbasic
source: Nonbasic
uk_ua: Небазисні

# CountedPercentageForTaskTextBlock
source: Counted average percentage for your task
uk_ua: Знайдений середній відсоток для вашої задачі

# DistanceLabel
source: Distance:
uk_ua: Відстань:

# DistributionLabel
source: Choose distribution:
uk_ua: Оберіть закон розподілу:

# ExceptionCheckboxesC
source: The C values change parameter must be selected
uk_ua: Оберіть параметр зміни значень матриць С

# ExceptionLabelAccuracyNOTChosen
source: Choose an accuracy
uk_ua: Оберіть точність перехідного періоду для експерименту

# ExceptionLabelDelayNumeric
source: The delay must be numeric
uk_ua: Середнє значення для закону розподілу має бути числом

# ExceptionLabelDelayPositive
source: The delay must be positive
uk_ua: Середнє значення для закону розподілу має бути додатним

# ExceptionLabelDeviationNumeric
source: The deviation must be numeric
uk_ua: Відхилення для закону розподілу має бути числом

# ExceptionLabelDeviationPositive
source: The deviation must be positive
uk_ua: Відхилення для закону розподілу має бути додатнім

# ExceptionLabelDistributionABNOTChosen
source: The distribution for a and b is not chosen yet
uk_ua: Закон розподілу для значень векторів a та b не обраний

# ExceptionLabelDistributionCNOTChosen
source: The distribution for matrixes is not chosen yet
uk_ua: Закон розподілу для значень матриць вартостей не обраний

# ExceptionLabelDistributionLNOTChosen
source: The distribution for l is not chosen yet
uk_ua: Закон розподілу для значень вектора верхніх меж l не обраний

# ExceptionLabelFileChosenSuccesslully
source: File chosen successfully
uk_ua: Файл обрано

# ExceptionLabelFileIsNOTChosen
source: The file is not chosen
uk_ua: Файл не обрано

# ExceptionLabelIncorrectFileFormat
source: Incorrect format of input file
uk_ua: Некоректний формат вхідного файлу

# ExceptionLabelIntegerN
source: The 'n' must be integer
uk_ua: Розмір матриць (n) має бути цілим числом

# ExceptionLabelIntegerR
source: The 'R' must be integer
uk_ua: Кількість матриць (R) має бути цілим числом

# ExceptionLabelInvalidRangeSizing
source: Invalid range of sizing
uk_ua: Некоректний діапазон зміни розміру матриць

# ExceptionLabelNOTEnoughData
source: There is not enough data for this task
uk_ua: Недостатньо даних для значень введеної задачі

# ExceptionLabelNOTEnoughDataForParameters
source: There is not enough data for this size of matrix (n) and experts quantity (R)
uk_ua: Недостатньо даних для задачі такої розмірності матриць (n) та кількості матриць (R)

# ExceptionLabelNRangeIntegers
source: The range must consist of integers
uk_ua: Діапазон зміни розміру матриць має бути цілим числом

# ExceptionLabelPositiveN
source: The 'n' must be positive
uk_ua: Розмірність матриць (n) має бути натуральним числом

# ExceptionLabelPositiveR
source: The 'R' must be positive
uk_ua: Кількість матриць (R) має бути натуральним числом

# ExceptionLabelRangeNumbers
source: The range C must consist of numbers
uk_ua: Діапазон має містити лише числа

# ExceptionLabelRangePositive
source: The range C must be positive
uk_ua: Числа діапазону мають бути додатніми

# ExceptionLabelRangeStartsInPositive
source: The range C must be in positive numbers
uk_ua: Числа діапазону мають бути додатніми

# ExceptionLabelRInvalidQuatitySizing
source: Invalid range of quantities
uk_ua: Некоректний діапазон зміни кількостей матриць

# ExceptionLabelRRangeIntegers
source: The range R must consist of numbers
uk_ua: Діапазон зміни кількостей матриць має бути цілим числом

# ExceptionLabelRRangePositive
source: The range R must be positive
uk_ua: Числа діапазону мають бути додатніми

# ExceptionLabelRStepInteger
source: The step R must be integer
uk_ua: Крок зміни кількостей матриць має бути натуральним числом

# ExceptionLabelRStepPositive
source: The step R must be positive
uk_ua: Крок зміни кількостей матриць має бути натуральним числом

# ExceptionLabelSizesMatrixesPositive
source: Sizes of matrixes must be positive
uk_ua: Розміри матриць (n) мають бути додатніми числами

# ExceptionLabelStepInteger
source: The step C must be integer
uk_ua: Крок зміни розмірності матриць має бути натуральним числом

# ExceptionLabelStepPositive
source: The step C must be positive
uk_ua: Крок зміни розмірності матриць має бути натуральним числом

# ExitButton
source: Exit
uk_ua: Завершити

source: Exponential
uk_ua: Експоненційний

# FailedPersistenceTestTextBlock
source: The percentage of change of input data is not acceptable. This means that the given compromise solution is not stable enough
uk_ua: Відсоток зміни вхідних даних неприйнятний. Це означає, що даний компромісний розв'язок недостатньо стійкий

# FindPercentButton
source: Find percent
uk_ua: Знайти відсоток зміни

# GeneratorABLabel
source: Generator for vectors a and b:
uk_ua: Генерування значень векторів a та b:

# GeneratorCLabel
source: Generator for matrixes C:
uk_ua: Генерування значень матриць вартостей (C):

# GeneratorLLabel
source: Generator for vector l:
uk_ua: Генерування значень вектора l:

# GraphPercentageLine
source: Percentage
uk_ua: Середній відсоток

# GraphPercentageY
source: Percentage of change by changing optimum
uk_ua: Середній відсоток зміни

# GraphSizeOfMatrixX
source: Size of matrix
uk_ua: Розмір матриць, n

# ListOfPercentagesDBTextBlock
source: List of percentages from the base for given size of matrixes:
uk_ua: Список відсотків із бази даних для заданого розміру матриць:

# MainTextBlock
source: Research process support system for transport problem under uncertainty
uk_ua: Система з підтримки дослідження транспортної задачі в умовах невизначеності

# MatrixesCLabel
source: Matrixes C:
uk_ua: Матриці вартостей (С):

# Matrixs
source: Matrixes
uk_ua: Mатриць

source: Normal
uk_ua: Нормальний

# OptimalValueLabel
source: Optimal Value:
uk_ua: Значення оптимального розв'язку:

# OptimalXLabel
source: Optimal X:
uk_ua: Оптимальний розв'язок:

# ParametersExpLabel
source: Delay mean:
uk_ua: Середнє значення:

# ParametersNormalLabel
source: Delay mean and deviation:
uk_ua: Середнє значення та відхилення:

# ParametersUniformLabel
source: Range for generator:
uk_ua: Діапазон:

# PercentageFromDBTextBlock
source: Average percentage based on data after performed experiments
uk_ua: Середній відсоток на основі даних після проведених експериментів

# PersistenceButton
source: Persistence Test
uk_ua: Випробування на стійкість

# PersistenceInputTextBlock
source: Choose a file with your task and solution for test and accuracy for percentage search
uk_ua: Оберіть файл із вашим завданням та розв'язком для перевірки та точність для перехідного періоду експерименту

# PersistenceSelectFileButton
source: Select file
uk_ua: Обрати файл

# ProcessingSize
source: Working on
uk_ua: Обробка при

# ProgressTextBlockCompleted
source: Experiment done!
uk_ua: Виконано!

# QuantityOfMatrixesLabel
source: Quantity of cost matrixes (R):
uk_ua: Кількість матриць (R):

# RangeChangingQuantityMatrixLabel
source: Range of changing quantity of matrix C:
uk_ua: Діапазон зміни кількості матриць (R):

# RangeChangingSizeMatrixLabel
source: Range of changing size of matrix C:
uk_ua: Діапазон зміни розміру матриць:

# RangeR
source: R range:
uk_ua: Діапазон для R:

# RunButton
source: Run
uk_ua: Виконати

# SaveGraphButton
source: Save graph
uk_ua: Зберегти графік

# SaveInputDataButton
source: Save input data
uk_ua: Зберегти вхідні дані

# SaveResultButton
source: Save result
uk_ua: Зберегти розв'язок

# SizeOfMatrixLabel
source: Size of matrix (n):
uk_ua: Розмір матриць (n):

# SolutionsXLabel
source: Solutions X:
uk_ua: Розв'язки часткових задач:

# SolverButton
source: Solver
uk_ua: Розв'язувач

# SolverFromFileButton
source: From file
uk_ua: Із файлу

# SolverInputLabel
source: Choose a type of input
uk_ua: Оберіть варіант введення вхідних даних:

# SolverRandomButton
source: Random
uk_ua: Згенерувати випадковим чином

# SolverRunFromFileButton
source: Run from file
uk_ua: Виконати з файлу

# StepChangingSizeMatrixLabel
source: Step in changing size of matrix C:
uk_ua: Крок зміни розміру матриць:

# StepR
source: Step for R change:
uk_ua: Крок зміни R:

# SuccesfulPersistenceTestTextBlock
source: The percentage of change of input data is acceptable for the given parameters. The compromise solution is stable enough
uk_ua: Відсоток зміни вхідних даних є прийнятним для вхідних параметрів. Компромісний розв'язок є досить стійким

source: Uniform
uk_ua: Рівномірний

source: Variables:
uk_ua: Змінні:
